Revit 2024 API
Sketch.OwnerId Property
 Returns id of the sketch owner element or invalidElementId if sketch does not build a geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public ElementId OwnerId { get; }
Visual Basic
Public ReadOnly Property OwnerId As ElementId
	Get
Visual C++
public:
property ElementId^ OwnerId {
	ElementId^ get ();
}
See Also
Sketch Class
Autodesk.Revit.DB Namespace